app/Controllers/Carrito.php

    public function guardar_venta()
    {
        $cart = \Config\Services::cart();
        $ventas = new Ventas_model();
        $detalle = new DetalleVenta_model();
        $productos = new Products_model();

        $cart1 = $cart->contents();

        foreach ($cart1 as $item) {
            $producto = $productos->where('id_producto', $item['id'])->first();
            if ($producto['cantidad_producto'] < $item['qty']) {
                return redirect()->route('carrito')->with('err','No se pudo realizar la venta porque no existe stock suficiente');
            }
        }

        $data = [
            'id_cliente' => session('usuario_id'),
            'venta_fecha' => date('Y-m-d'),
        ];

        $venta_id = $ventas->insert($data);
---
SELECT *
FROM `productos`
WHERE `id_producto` = '3'
 LIMIT 1
INSERT INTO `ventas` (`id_cliente`, `venta_fecha`) VALUES ('2', '2024-06-17')

                'detalle_precio' => $item['price']
            ];

            $producto = $productos->where('id_producto', $item['id'])->first();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '3'
 LIMIT 1

            ];

            // Actualiza el stock del producto
            $productos->update($item['id'], $data);
            // Insertar el detalle de Venta
            $detalle->insert($detalle_venta);
---
UPDATE `productos` SET `cantidad_producto` = 13
WHERE `productos`.`id_producto` IN ('3')
INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `detalle_cantidad`, `detalle_precio`) VALUES (2, '3', 1, 659000)