app/Controllers/Ventas.php

SELECT *
FROM `ventas`
WHERE `ventas`.`venta_id` = '2'
SELECT *
FROM `detalle_venta`
WHERE `id_venta` = '2'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '3'
---
    public function factura($id = NULL)
    {
        $session = session();
        $ventaModel = new Ventas_model();
        $detalleVentaModel = new DetalleVenta_model();
        $usersModel = new Users_model();
        $productosModel = new Products_model();

        $venta = $ventaModel->find($id);
        if (!$venta) {
            // Manejo de error si la venta no existe
            throw new \RuntimeException("Venta con ID {$id} no encontrada");
        }

        $detalleVenta = $detalleVentaModel->where('id_venta', $id)->findAll();

        // Calcular el total de la venta sumando los subtotales de cada detalle
        $totalVenta = 0;
        foreach ($detalleVenta as &$detalle) {
            $subtotal = $detalle['detalle_cantidad'] * $detalle['detalle_precio'];
            $totalVenta += $subtotal;

            // Obtener nombre del producto para cada detalle de venta
            $producto = $productosModel->find($detalle['id_producto']);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`usuario_id` = '2'
---
        // Obtener datos del usuario asociado a la venta
        $usuario = $usersModel->find($venta['id_cliente']); // Asumiendo que 'id_cliente' es la clave foránea que une ventas con usuarios

        $data = [
            'venta' => $venta,
            'detalleVenta' => $detalleVenta,
            'usuario' => $usuario,
            'total_venta' => $totalVenta,
            'titulo' => 'Detalle de Venta',
            'rol_id' => $session->get('rol_id'),
            'isLoggedIn' => $session->get('isLoggedIn'),
            'usuario_nombre' => $session->get('usuario_nombre'),
        ];